app/controllers/registrations_controller.rb

  def create
    user = User.new(sign_up_params)

    if user.save
---
INSERT INTO "users" ("email", "encrypted_password", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["email", "saimsohail466@gmail.com"], ["encrypted_password", "[FILTERED]"], ["created_at", "2022-11-18 05:48:42.822465"], ["updated_at", "2022-11-18 05:48:42.822465"]]